[
    [
    "211 Miami Hotline",
    "images/mh2.jpg",
    "mental-health",
	"211 Miami is a Jewish Community Services of South Florida program that offers 24/7 support in English, Spanish, and Creole to address needs like food insecurity, housing/shelter, legal assistance, clothing, and other resources. By reaching out to 211 Miami, clients can receive immediate emotional support and crisis counseling. 211 Miami works with the National Suicide Prevention Lifeline and is the number one US crisis center in answering Spanish Lifeline calls.",
	"https://211miami.org/",
	"",
	"Phone Number: 305-631-4211 and 211 (Hot-Line)",
	"Text your zip code to 898211 to message them.",
    "Non-profit",
	"Miami-based",
	[]
    ],
	[
    "Americans for Immigrant Justice",
    "images/im4.jpg",
    "immigration",
	"Americans for Immigrant Justice is a law firm that supports immigrants by championing the rights of unaccompanied immigrant children, helping immigrant survivors of trafficking and domestic abuse, keeping immigrant families informed and together, and providing support to immigrants in court cases.",
	"https://aijustice.org/",
	"Address: 1279 NE 79th Street Causeway, Miami, FL 33138",
	"Phone Number: 305-573-1106",
	"Email: info@aijustice.org",
    "Non-profit",
	"National",
	[]
    ],
	[
    "Baptist Health",
    "images/he4.jpg",
    "health",
	"Baptist Health South Florida, the largest private health network in South Florida, provides personalized medical care for each of its patients, ranging from brain and spine, cancer, heart and vascular, orthopedic and sports, primary, and urgent care. Baptist Health South Florida provides financial assistance based on income, family size, and assets for medically necessary services. On the academic side, Baptist Health South Florida does research and offers post-graduate residency and fellowship programs.",
	"https://baptisthealth.net/",
	"Find the contact information of the location nearest to you here: https://baptisthealth.net/locations. ",
	"",
	"",
    "Non-profit",
	"South-Florida-based",
	[]
    ],
	[
    "Bridge to Hope",
    "images/fo1.webp",
    "food",
	"Bridge to Hope provides fresh food to those in need. More than just giving food, Bridge to Hope also provides cooking demonstrations, USDA-approved recipes, hygiene products, health screenings, and digital literacy programs to help families learn how to support themselves. Bridge to Hope also created the Anti-Prison Pipeline to give at-risk youth STEM and leadership training to give them the ability to succeed in their lives. Lastly, Bridge to Hope's Project e-QUALity provides internet service, free devices, and digital skills training to those in need to help connect Miami.",
	"https://bridgetohope.net/",
	"Address: 10844 SW 188th Street, Cutler Bay, FL 33157",
	"Phone Number: 786-269-1608",
	"Email: info@bridgetohope.net",
    "Non-profit",
	"Miami-based",
	[]
    ],
	[
    "Catholic Legal Services",
    "images/im2.jpg",
    "immigration",
	"Catholic Legal Services provides professional legal services to refugees and immigrants regardless of their faith or nation of origin. They provide assistance with every aspect of the immigration process including asylum applications, reapplications after removal, DACA renewals, work permit applications, family petitions, visas, and status changes.",
	"https://www.cclsmiami.org/default.aspx",
	"Address: 1469 NW 13th Terr, Suite 100, Miami, FL 3312 and 6565 TAFT ST, 4th Floor, Hollywood, Florida 33024",
	"Phone Number: 305-373-1073 and 954-306-9537",
	"As a new client, to receive help come in on Monday or Tuesday. Otherwise, schedule a new appointment here: https://www.cclsmiami.org/clients/. ",
    "Non-profit",
	"Miami-based",
	[]
    ],
	[
    "Community Health of South Florida, Inc. (CHI)",
    "images/he5.jpg",
    "health",
	"Community Health of South Florida, Inc. (CHI) provides healthcare across its 13 centers in a culturally-sensitive way. CHI gives all people who walk-in high-quality care. They accept most insurances and have a small income-based fee based for uninsured patients. CHI also offers cheaper medications than pharmacies at $4. CHI provides primary, pediatric, behavioral health, women's health, dental health, urgent, walk-in, vision, and heart/vascular care, as well other services found on their website.",
	"https://redlandconservationcenter.com/",
	"Address: 10300 SW 216th St., Miami, FL 33190 and other locations here: https://chisouthfl.org/locations/.",
	"Phone Number: 305-252-4820 (Regular Hours) and 305-253-5100 (After Hours)",
	"They can be messaged here: https://chisouthfl.org/contact-us/.",
    "Non-profit",
	"South-Florida-based",
	[]
    ],
	[
    "Department of Environmental Resources Management (DERM)",
    "images/ev3.webp",
    "environment",
	"The Department of Environmental Resources Management (DERM) creates Miami's environmental policies. DERM also holds various environmental volunteer events that you can join, ranging from clean-up days to adopting a tree or buoy.",
	"https://www.miamidade.gov/global/environment/home.page",
	"Address: Overtown Transit Village North, 701 NW 1st Court, Miami, FL 33136",
	"Phonr Number: 305-372-6789",
	"",
    "Gov Orginization",
	"Miami-based",
	[]
	],
	[
    "Family Action Network Movement (FANM)",
    "images/im5.jpg",
    "immigration",
	"FANM started to support Haitian immigrant women and now supports all Miami immigrants with mental health, crisis and domestic violence intervention, counseling, health care access, job training, financial literacy, adult education, and after school programs. The group also advocates for other major issues like housing, immigration reform, climate change, and equality.",
	"https://www.fanm.org/",
	"Address: 100 NE 84th Street, Miami, FL 33138",
	"Phone Number: 305-756-8050",
	"Email: info@fanm.org",
    "Non-profit",
	"Miami-based",
	[]
    ],
	[
    "Farm Share",
    "images/fo4.jpg",
    "food",
	"Farm Share is Florida's main foodbank that feeds Floridians in need across all of Florida. They are partnered with over 2,000 food pantries, churches, schools and other nonprofits that help distribute healthy and nutritious food. Farm Share also partners with farmers to make sure any edible food that is not fit for standard grocery store packaging (due to size or minor blemishes) does not go to waste.",
	"https://www.farmshare.org/",
	"Visit their website to find a Food Pantry of theirs near you.",
	"Phone Number: 305-246-3276",
	"Email: Information@Farmshare.org",
    "Non-profit",
	"Florida-based",
	[]
    ],
	[
    "Florida Immigration Coalition",
    "images/im3.jpg",
    "immigration",
	"The Florida Immigration Coalition's 83 member organizations and over 100 allies work in immigration, community building, and civic engagement. In immigration, they provide naturalization, TPS, and legal screening clinics. They help build community through various events to make sure immigrants feel accepted. They also make sure people, including immigrants, are aware of how they can participate in the government.",
	"https://floridaimmigrant.org/",
	"Address: 1279 NE 79th Street Causeway, Miami, FL 33138",
	"Phone Number: 307-571-7254",
	"Email: info@flic.org",
    "Non-profit",
	"Florida-based",
	[]
    ],
	[
    "Florida Virtual School (FLVS)",
    "images/ed2.webp",
    "education",
	"Through Florida Virtual School (FLVS), Florida students can receive free online education in 200+ courses, even including AP courses. Through FLVS, students can register for full time online public school for K-12 or individual FLVS Flex courses to learn more and gain extra course credits outside of school. All students, including traditional public and private school students as well as homeschool students can register for FLVS Flex courses.",
	"https://www.flvs.net/",
	"Address: 5422 Carrier Drive, Suite 201, Orlando, Florida 32819",
	"Phone Number: 800-374-1430",
	"Other contact info can be found at https://www.flvs.net/contact-us.",
    "Gov Organization",
	"Florida-based",
	[]
    ],
	[
    "Friends of the Miami-Dade Public Library",
    "images/ed3.jpg",
    "education",
	"Friends of the Miami-Dade Public Library advocates and fundraises for Miami-Dade's public library system. The nonprofit organizes many events like their annual book club fair, multiple member socials, 5k run to fundraise for public libraries, guest speaker talks, and more.",
	"https://friendsofmdpl.org/",
	"Contact information for local branches can be found here: https://friendsofmdpl.org/contact-us.",
	"",
	"Email: customercare@mdpls.org",
    "Non-profit",
	"Miami-based",
	[]
    ],
	[
    "International Rescue Committee (IRC) Miami Division",
    "images/im6.jpg",
    "immigration",
	"The International Rescue Committee (IRC) responds to humanitarian crises across the world, helping restore the health, safety, education, and economic wellbeing of those affected. In Miami, the IRC provides holistic, trauma-informed care towards all refugees and immigrants who had to escape to America. They also work to raise awareness of human trafficking issues with the South Florida Human Trafficking Task Force and local/federal government law enforcement.",
	"https://www.rescue.org/united-states/miami-fl",
	"Address: P.O. Box 453504, Miami, FL33245",
	"Phone Number: 305-640-9881",
	"They can be messaged on their website.",
    "Non-profit",
	"Miami-based",
	[]
    ],
	[
    "Jackson Health System",
    "images/he2.jpg",
    "health",
	"Jackson Health System offers world-class health care to all people in need, including un-insured patients, in Miami-Dade County regardless of their ability to pay. Jackson Health System is run by citizen volunteers from Miami-Dade Board of County Commissioner's Public Health Trust. Outside of high quality medical care, Jackson Health System also works in academic medical research.",
	"https://jacksonhealth.org/",
	"Find the address of their hospital nearest to you here: https://jacksonhealth.org/about-us/.",
	"305-585-1111",
	"Request an appointment here: https://jacksonhealth.org/request-an-appointment/.",
    "Non-profit",
	"Miami-based",
	[]
    ],
	[
    "Lotus House",
    "images/mh4.JPG",
    "housing",
	"Lotus House is the world's largest women's shelter in the nation, sheltering 1450+ women annually. Outside of just shelter and basic resources, Lotus House provides complex support services to help their guests exit the shelter system and live lives on their own terms. Some of their programs include therapy and supportive sessions, employment and education assistance, and artistic training to help cope through trauma.",
	"https://lotushouse.org/",
	"Address: 217 NW 15th Street, Miami, FL 33136",
	"Phone Number: 305-438-0556",
	"Email: love@lotushouse.org",
    "Non-profit",
	"Miami-based",
	[]
    ],
	[
    "Miami Connected",
    "images/te1.jpg",
    "technology",
	"Miami Connected is an organization dedicated to creating a Miami with better tech literacy, a lessened digital divide, and greater accessibility to technology. They have helped build infrastructure to offer better broadband technologies and decrease the affordability gap. By partnering with local community organizations and NorthStar Digital Literacy they have set up digital literacy programs. Miami Connected also helps locals obtain jobs in the tech industry.",
	"https://miamifoundation.org/miami-connected/",
	"Address: 40 NW 3rd Street, Suite 305, Miami, FL 33128",
	"Phone Number: 305-371-2711",
	"Email: info@miamifoundation.org",
    "Non-profit",
	"Miami-based",
	[]
    ],
	[
    "Miami Tech Works",
    "images/te2.webp",
    "technology",
	"Miami Tech Works brings together community organizations and resources with the goal of empowering and improving the talents of people wanting to get technology jobs and connecting them with employers.",
	"https://miamitechworks.org/",
	"They can be contacted on their website.",
	"",
	"",
    "Gov Organization",
	"Miami-based",
	[]
    ],
	[
    "Miami-Dade College Food Pantry",
    "images/fo2.jpg",
    "food",
	"The Student Food Pantry allows students who may be struggling financially to be able to consistently get food so they don't have to worry about food and can focus on their studies. The Student Food Pantry is only for Miami Dade College students.",
	"https://redlandconservationcenter.com/",
	"Contact information for local branches can be found on website.",
	"",
	"",
    "Gov Organization",
	"Miami-based",
	[]
    ],
	[
    "Miami-Dade Office of New Americans",
    "images/im1.jpg",
    "immigration",
	"The Office of New Americans (ONA) helps legal permanent residents become US citizens. They provide referrals to free or low-cost legal services, referrals to language support and civics classes, citizen application workshops, and education on what it means to be a US citizen.",
	"https://www.miamidade.gov/global/initiatives/newamericans/home.page",
	"Address: 970 SW 1st St Suite #304, Miami, FL 33130",
	"",
	"",
    "Gov Organization",
	"Miami-based",
	[]
    ],
	[
    "Miami Music Project",
    "images/ed5.jpg",
    "education",
	"Miami Music Project uses music for social change by giving underserved youth the chance to participate in classical music that they may not have had the support to participate in otherwise. They spread the joy of music through their Children's Orchestras, Summer Music Camp, Orchestra Boot Camps, their online Teaching Artist Training Institute, and more. Miami Music Project was even awarded a 2024 Music Cities Award for Best Initiative to Support Diversity & Inclusion in Music.",
	"https://miamimusicproject.org/",
	"Address: 101 NW 8th St, Ste. 200, Miami, FL 33136",
	"Phone Number: 786-422-5221",
	"Email: info@miamimusicproject.org",
    "Non-profit",
	"Miami-based",
	[]
    ],
	[
    "NAMI Miami-Dade County",
    "images/mh3.jpg",
    "mental-health",
	"NAMI (National Alliance for the Mentally Ill) Miami-Dade County brings awareness about mental health issues, works to reduce mental illness stigma, and advocates for increased funding into mental illness research. Outside of providing online resources NAMI Miami-Dade County has many in-person mental health events like their mental health walks and their mental health film festival Reel Minds as well as in-person courses.",
	"https://namimiami.org/",
	"Address: 3150 SW 38th Ave., Suite 500, Miami, FL 33146",
	"Phone Number: 305-665-2540 (for English, French, Portuguese, and Haitian Creole) and 786-308-9680 (para Español)",
	"Email: Help@NAMIMiami.org",
    "Non-profit",
	"Miami-based",
	[]
    ],
	[
    "New Village Academy",
    "images/ed1.jpg",
    "education",
	"New Village Academy is a prestigious partner school that provides K-12 students with online course options, including online curriculums with exams, grading, record-keeping, diplomas, and transcripts. The program also helps facilitate homeschooling and provides tutoring for K-8 students. All courses are NCAA approved for child-athletes looking to join college athletics programs.",
	"https://www.newvillageacad.com/",
	"Address: 4816 SW 72nd Ave, Miami, FL 33155",
	"Phone Number: 305-321-0031",
	"Email: nvacademymiami@gmail.com",
    "For Profit",
	"Miami-based",
	[]
    ],
	[
    "Nicklaus Children's Hospital: Child and Adolescent Specialized Assessments",
    "images/he1.jpg",
    "health",
	"Nicklaus Children's Hospital is a pediatric hospital in Miami. Their Child and Adolescent Specialized Assessment Program helps identify whether adolescents, school-age children, and younger children have any of the following issues : anxiety disorders, attention deficit and learning disorders (including ADHD), autism, depression, dyslexia, and speech disorders. This program is a private fee-based alternative to regular free school-based services that may have long wait lines.",
	"https://www.nicklauschildrens.org/medical-services/psychology/programs/casa-program",
	"Address: 6262 Sunset Drive, Suites 300 & 500, South Miami, FL 33143",
	"Phone Number: 786-624-3566",
	"",
    "For profit",
	"Miami-based",
	[]
    ],
   [
    "Pelican Harbor Seabird Station",
    "images/ev1.jpg",
    "environment",
    "Pelican Harbor Seabird Station started out as a hospital for injured brown pelicans. Now, it takes in all kinds of injured native animals (birds, mammals, and reptiles) any time of the year. The station treats each of its animals with the hope of releasing them back into the wild. They frequently work with other groups and government agencies to help conserve Miami wildlife.",
    "https://www.pelicanharbor.org/",
	"Address: 1279 NE 79th Street Causeway, Miami, FL 33138",
	"Phone Number: 305-751-9840",
	"Email: info@pelicanharbor.org",
	"Non-profit",
	"Miami-based",
    [
      {
        "username": "anonymous",
        "text": "would recommend",
        "timestamp": "2026-01-14 11:26:26"
      }
    ]
  ],
  [
    "Project UP-START",
    "images/ed4.webp",
    "education",
	"Project UP-START supports the education of students living in unstable housing to help them from ending up isolated. They help students with enrollment, attendance, and academics as well as helping make sure teachers are aware of their unstable housing situation, so they can properly support their students. All students from Head Start to 12th grade who don't have a regular nighttime residence qualify for Project UP-START.",
	"https://projectupstart.dadeschools.net",
	"",
	"",
	"Contact information for local branches can be found here: https://projectupstart.dadeschools.net/#!/fullWidth/5568",
    "Gov Organization",
	"Miami-based",
	[]
  ],
  [
    "Redland Conservation Center",
    "images/ev2.jpg",
    "environment",
	"The Redland Conservation Center includes wild animals from all over the world with the intention of protecting them and educating people about the importance of the natural world. The center also supports conservation directly by partnering with other Miami organizations. They also have breeding programs to keep up certain endangered animal populations. People can visit by going on one of their paid jungle tours or paying for an animal encounter.",
    "https://redlandconservationcenter.com/",
	"Address: 1279 NE 79th Street Causeway, Miami, FL 3313824025 sw 167th Ave Homestead, FL 33031",
	"",
	"Send messages through their website : https://redlandconservationcenter.com/pages/contact-1",
    "Non-profit",
	"Miami-based",
	[]
   ],
   [
    "Share Your Heart",
    "images/fo3.webp",
    "food",
	"Share Your Heart works to support people in need of all ages by providing food, clothing, employment services, emotional and spiritual support, and other resources. In Share Your Heart's Chaplaincy Program, trained volunteers respond to referrals for all listed needs within 48 hours. At their main office, people can select clothes, food and other supplies for no cost. Their fire truck is brought to events at schools and the general public to bring fun and needed resources.",
    "https://redlandconservationcenter.com/",
	"Address: 2400 South Dixie Highway, Miami FL 33133 and 3302 NW 27 Ave, Miami FL 33142",
	"Phone Number: (866) 371-0444 and (786) 362-5870 (after hours)",
	"Email: INFO@VICTORYFORYOUTH.ORG",
    "Non-profit",
	"Florida-based",
	[]
   ],
   [
    "Thriving Mind South Florida",
    "images/mh1.png",
    "mental-health",
	"Thriving Mind South Florida provides compassionate care for South-Floridians with mental illnesses and substance-use disorders. They go beyond what is required to provide mental health services that allow patients to support themselves after care. For the chronically homeless, Thriving Mind teams up with local Miami police to help them get treatment for substance abuse and find housing. ",
	"https://thrivingmind.org/",
	"Address: 7205 NW 19th Street, Suite # 200, Miami, Florida 33126",
	"Phone Number: 305-858-3335 and 888-248-3111 (Help-Line)",
	"They can be messaged here : https://thrivingmind.org/contact.",
    "Non-profit",
	"South-Florida-based",
	[]
    ],
    [
    "Tropical Audubon Society",
    "images/ev4.webp",
    "environment",
	"Audubon works to stop the decline in population of birds across the Americas through preserved bird habitats, scientific research, spreading awareness, and discussion with policymakers to enact commonsense conservation laws that protect birds. In the Miami-Dade and Monroe counties Audubon focuses on water quality and habitat sustainability in Biscayne Bay, Florida Bay, and the Everglades.",
	"https://tropicalaudubon.org/",
	"Address: 5530 Sunset Dr, Miami, FL, 33143",
	"Phone Number: 305-667-7337",
	"Email: OUTREACH@TROPICALAUDUBON.ORG",
    "Non-profit",
	"South-Florida-based",
	[]
   ],
   [
    "University of Miami Health System",
    "images/he3.jpg",
    "health",
	"UHealth (University of Miami Health System) provides world-class academic-based health care to people in Miami and performs medical research. UHealth is one of five facilities in the nation to be named a 2025 Ambulatory Quality and Accountability Top Performer by Vizient®.  UHealth's SoLé Mia Medical Center is South Florida's only NCI-designated cancer center.",
	"https://umiamihealth.org/",
	"Find the address of the location nearest to you at umiamihealth.org/locations.",
	"Phone Number: 305-243-4000",
	"",
    "Non-profit",
	"Miami-based",
	[]
    ]
]

